// Сборка: g++ -O3 01_micrograd.cpp -o 01_micrograd
// Запуск: ./01_micrograd

/* градиент простыми словами c=a*b где a=2 b=3
Градиент(производная) отвечает на один вопрос Если я чуть чуть подкручу ручку а насколько
сильно измениться ответ с?  с=а*3 то если мы увеличим а на 1 (сделаем 3 вместо 2)
результат с вырастет на 3(было 6 стало 9). Значит влияние (градиент) переменной а равно 3(
    то есть значению b. А если бы b изначально увеличили бы на 1, то результат вырос бы на 2 
    (2*4=8) значит градиент b равен 2.
) */

#include <iostream>
#include <vector>
#include <cmath>
#include <memory>
#include <functional>
#include <unordered_set>
#include <iomanip>
#include <cassert>


/* Нужен помощник чтобы проверить дробные же числа*/
bool is_close(double a, double b, double tol=1e-4){
    return std::abs(a-b) <tol;
}

struct Value {
    double data;// само число (например 2.0)
    double grad;// Сила влияния этого числа на итоговый ответ(пока 0.0)
    std::vector<std::shared_ptr<Value>> prev;// Список родителей-из каких коробок получилось это
    std::function<void()> _backward;// Инструкция шпаргалка, как посчитать grad  для родителей

    // Конструктор: когда создаем коробку, кладем число в data, а grad обнуляем
    Value(double d) : data(d), grad(0.0), _backward([](){}) {}
};

using ValPtr = std::shared_ptr<Value>;
/* В с++ если создать переменную внутри функции она исчезнет при выходе из функции
Чтобы наши коробочки (Value) жили долго и могли ссылаться друг на друга в графе мы создаем
их общей памяти компбтера и держим за веревочку- умный указатель std::shared_ptr
Чтобы каждый раз не писать длинное std::shared_ptr<Value>, мы дали ему короткую кличку ValPtr*/

ValPtr make_val(double d) { return std::make_shared<Value>(d); }
/* Функция make_val(double d) просто создает новую коробочку с числом и дает веревочку от нее.*/


// Сложение когда пишешь с=a*b, c++ не знает как умножать наши коробочки. Обучим с operator*
ValPtr operator+(ValPtr a, ValPtr b) {
    // 2.0*3.0=6.0 и кладем в новую коробку out
    ValPtr out = make_val(a->data + b->data);

    // Записываем в память коробки out что ее родители это a b 
    out->prev = {a, b};

    // Берем обычную коробку чтобы память не зависла
    Value* raw_out = out.get(); // Избегаем циклической ссылки!

    // Пишем шпаргалку на будущее 
    out->_backward = [a, b, raw_out]() {
        a->grad += 1.0 * raw_out->grad;// Берет 0.0, прибавляет (1.0*1.0). Теперь a->grad=1.0
        b->grad += 1.0 * raw_out->grad;
    };
    return out;
}

void test_addition(){
    ValPtr a = make_val(3.0);
    ValPtr b = make_val(2.0);
    ValPtr c = a+b; // 3+2=5

    c->grad=1.0;
    c->_backward();

    assert(is_close(c->data, 5.0)); // само число
    assert(is_close(a->grad, 1.0)); // градиент а (+1)
    assert(is_close(b->grad, 1.0)); // градиент b (+1)

    std::cout << " addition OK\n";

}

// Прямое вычитание (без создания лишних узлов для -1.0)
ValPtr operator-(ValPtr a, ValPtr b) {

    ValPtr out = make_val(a->data - b->data);
    out->prev = {a, b};
    Value* raw_out = out.get();
    out->_backward = [a, b, raw_out]() {
        a->grad += 1.0 * raw_out->grad;
        b->grad -= 1.0 * raw_out->grad;
        /*было 3-2=1 сделали а+1 4-2=2 прибавилась единица к ответу вот поэтому а+
        к прибавили b+1 3-3=0 упал на единицу и стало 0 изменилось на единицу -1 вот поэтому
        b- */
    };
    return out;
}

void test_substraction(){
    ValPtr a = make_val(3.0);
    ValPtr b = make_val(2.0);
    ValPtr c = a-b; // 3-2=1

    c->grad = 1.0;
    c->_backward();

    assert(is_close(c->data, 1.0));
    assert(is_close(a->grad, 1.0)); // +1
    assert(is_close(b->grad, -1.0)); // -1
    std::cout << "subtraction OK\n";
}

// Умножение как и сложение кроме backward
ValPtr operator*(ValPtr a, ValPtr b) {
    ValPtr out = make_val(a->data * b->data);
    out->prev = {a, b};
    Value* raw_out = out.get();
    out->_backward = [a, b, raw_out]() {
        a->grad += b->data * raw_out->grad;// Влияние а зависит от числа b
        b->grad += a->data * raw_out->grad;// Влияние b зависит от числа а
        /* Почему так. Представь покупаешь яблока  а-это цена одного яблока(2)
        b-это кол-во яблок в пакете(100 штук). out=a*b (2*100=200) А теперь самое важное
        про градиент что будет если мы увеличим цену яблока а на 1 рубль было 2*100 
        стало 3*100=300*/
    };
    return out;
}

void test_multiplication(){
    ValPtr a = make_val(2.0);
    ValPtr b = make_val(100.0);
    ValPtr c = a * b; // 2 * 100 = 200

    c->grad = 1.0;
    c->_backward();

    assert(is_close(c->data, 200.0));
    assert(is_close(a->grad, 100.0)); // число из b
    assert(is_close(b->grad, 2.0)); // число из а

    std::cout << "Multiplication OK\n";
}



// Нелинейная функция активации tanh(x)
/* Функция tahn_act - это ограничитель или сжиматель для чисел в нейросети. Она берет
любое число из коробки а и плавно сжимает его в диапазон от -1.0 до 1.0, а в шпаргалку 
записывает формулу(1.0-t*t) которая показывает насколько было сжато. Теперь есть пол и
потолок. */
ValPtr tanh_act(ValPtr a) {
    // Допустим в коробке число 0.88 tanh выдаст примерно 0.7 сохраним переменную t
    double t = std::tanh(a->data);

    // Кладем полученное число t в коробку новую out
    ValPtr out = make_val(t);

    // Записываем родителя родитель один
    out->prev = {a};

    // Прямая ссылка на коробку out
    Value* raw_out = out.get();

    // 
    out->_backward = [a, raw_out, t]() {
        a->grad += (1.0 - t * t) * raw_out->grad;
        /* Пример t = 0.7071, raw->grad=1.0 формула a->grad+=(1.0-t*t)*raw_out->grad
        Считаем (1.0-0.7071*0.7071)*1.0=(1.0-0.5)*1.0=0.5
        Интересный пример если пришло число например 23 оно настолько большое и сожмем
        будет 0. Даже крутить крутилки бесполезно +1 -1 ничего не даст все равно высокая 
        больше 1.0 (Кстати на настоящих нейросетях эту ситуацию так и называют нейрон насытился
        или уснул поэтому веса стараются делать маленькими чтобы числа перед tanh держались
        ближе к нулю )
        В нейросетях используют как шкалу нейрона
        -1.0 = Категорически НЕТ (100%) 0.0= Сомневаюсь 50/50 +1.0= Да(уверен на все 100%)*/
    };
    return out;
}

void test_tahn(){
    ValPtr a = make_val(0.88);
    ValPtr out = tanh_act(a);
    out->grad = 1.0;
    out->_backward();

    assert(is_close(out->data, 0.7064));
    assert(is_close(a->grad, 0.5010));
    std::cout << " Tanh OK\n";

}

// Топологическая сортировка и обратный проход (Backpropagation) 
/* Пример житейский сначала надеваем носки а потом только ботинки
сначала родители должны встать шеренгу а потом дети, дети их детей автопилот */
void backward(ValPtr root) {

    std::vector<ValPtr> topo;
    /*Topo Очередь обычный список массивов куда мы будем складывать коробки по порядку
    сначала самые первые числа(a,b) потом промежуточные(с,d) и в конце ответ (е)*/

    /* Visited(Блокнот уже проверено). Представь что коробка а использовалась в формуле
    дважды.(с=а*а). Чтобы наш разведчик не ходил по кругу и не добавлял одну и ту же коробку 
    а в очередь десять раз, они записвает адрес каждой проверенной коробки в блокнот*/
    std::unordered_set<Value*> visited;

    /* Это функция внутри функции(рекурсия- чтобы нырнуть вглубь)*/
    std::function<void(ValPtr)> build_topo = [&](ValPtr v) {
        
        // Смотрим в блокнот мы уже были в коробуке v?
        if (visited.find(v.get()) == visited.end()) {

            // Если нет ставим галочку Проверено!
            visited.insert(v.get());

            // Cначала идем ко всем родителям этой коробки (в список prev)
            for (const auto& child : v->prev) {
                build_topo(child);// Запускаем разведчика для каждого родмителя
            }

            // И только когда все родители уже в очереди встаем в очередь сами
            topo.push_back(v);


        }
    };

    build_topo(root);
    /* Когда срабатывает build_topo(root) (где root это е)
    Разведчик приходит к е. Встать в очередь пока не может-нужно проверить ролдителей е
    (это с и d). Разведчик ныряет в родителя с. Но у с тоже есть родители(а и b)
    Разведчик ныряет в а. У а родителей нет (prev пустой) Поэтому а встает в очередь первой
    topo=[a] Разведчик проверяет второго родителя с-коробку b. У него тоже нет родителей
    topo=[a, b] Теперь у коробки с все родители на месте. И она наконец встает в очередь
    topo=[a, b, c] Разведчик проверяет второго родителя е - коробку d 
    topo=[a, b, c, d] Все предки проверены! В самый конец очереди встает самая главная коробка е
    Итоговая шеренга topo=[a, b, c, d, e]*/

    // Градиент выходного узла по самому себе равен 1, даем стартовый импульс
    root->grad = 1.0;

    // Идем в обратном порядке (от выхода к входам)
    /* Теперь у нас идеальная шеренга [a, b, c, d, e]. Чтобы посчитать градиенты нам нужно 
    пройтись по этой шеренге задом наперед(от е к а) и нажать backward  у каждой коробки */
    for (auto it = topo.rbegin(); it != topo.rend(); ++it) {
        (*it)->_backward();
    }
}

void test_backward_training(){
    ValPtr a = make_val(2.0); // Вход 2 
    ValPtr b = make_val(3.0); // Крутилка стартуем с 3 (хотим найти 5)
    ValPtr target = make_val(10); // Цель 10 (ведь 2 * 5 = 10)
    /* Создаем коробочки 3 со значениями*/

    double lr = 0.05;

    for (int step = 0; step < 20; ++step){
        ValPtr pred = a * b; // Ответ сейчас (на 1 шаге: 2 * 3 = 6) 
        ValPtr diff = pred - target;; // Промах (6 - 10 = -4)
        ValPtr loss = diff * diff; // Штраф (-4 * -4 = 16)
        /* Здесь в цикле вычисляем 3 строчки(операторы * - * у каждого свой backward), 
        создаем новые коробочки data=6.0 , заполняем данные,
        родителей pred->prev={a,b}, и шпаргалка backward- когда попросят сделать шаг 
        назад я прибавлю a->grad число(b->data * pred->grad) и так далее
        но еще все grad=0.0. 
         */

        b->grad = 0.0; // Стираем старую подсказку
        backward(loss); // Автопилот проходит назад loss->diff->pred->b
        /* вызываем это функцию первая половина этой функции build_topo(loss)
        выстраиваем очередь от первых до родитлей шеренга[a,b,pred,target,diff,loss]
        потом нажимаем кнопки шпрагалок даем импульс root->grad=1.0; потом в цикле 
        rbegin до rend запускаем у каждого (*it)->_backward();
        1шаг коробка loss, data=16 diff у нас 2 коробки diff->grad=0+(-4*1)+(-4*1)=-8.0
        2шаг короб diff, data=-4 pred->grad=0+(1.0*8.0)=-8.0 target-grad=0-(1.0*-8.0)=+8.0
        3шаг короб target, data=10 шпаргалка пустая ничего не меняется
        4шаг короб pred, data=6 a->grad=0+(3.0*-8.0) =-24.0 b->grad=0+(2.0*-8.0)=-16.0
        теперь выходим из backward и поварачиваем крутилку b->data(3.0)-=0.1*b->grad(3.0) это
        у нас 3.0-(-1.6)=3.0+1.6=4.6 и результат после первого цикла прыгнул с b=3.0 до b=4.6
        сама вот это магия и дальше круги ошибка будет меньше и встанет плавно 5.0 */

        std::cout << "Шаг " << std::setw(2) << step
                  << " | b = " << std::fixed << std::setprecision(4) << b->data
                  << " | pred = " << pred->data
                  << " | loss = " << loss->data
                  << " | grad = " << b->grad << "\n";
     

        b->data -= lr * b->grad; // Крутим ручку против штрафа
    }

    assert(is_close(b->data, 5.0)); // Программа сама нашла множитель 5!
    std::cout << "Backward & Training OK \n";

}



// int main() {
//     ValPtr x = make_val(2.0);      // Вход (не меняется)
//     ValPtr w = make_val(3.0);      // Крутилка (начинаем с 3.0, должна стать 5.0)
//     ValPtr target = make_val(10.0); // Цель, которую мы хотим получить на выходе

//     // Делаем 10 попыток (шагов обучения)
//     for (int step = 1; step <= 10; ++step) {
        
//         // 1. ПРЯМОЙ ПРОХОД: пробуем умножить и смотрим, насколько ошиблись
//         ValPtr pred = x * w;               // Наш ответ сейчас (на 1 шаге: 2 * 3 = 6)
//         ValPtr diff = pred - target;       // Разница с целью (6 - 10 = -4)
//         ValPtr loss = diff * diff;         // Ошибка в квадрате (-4 * -4 = 16). Чем ближе к 0, тем лучше!

//         // 2. ОБРАТНЫЙ ПРОХОД: обнуляем старые градиенты и запускаем твои шпаргалки!
//         w->grad = 0.0;
//         backward(loss); // Программа сама прошла назад и записала подсказку в w->grad!

//         // 3. ПОДКРУЧИВАЕМ РУЧКУ 'w' В ПРОТИВОПОЛОЖНУЮ ОТ ОШИБКИ СТОРОНУ:
//         w->data = w->data - 0.1 * w->grad;

//         std::cout << "Шаг " << step 
//                   << " | Крутилка w = " << w->data 
//                   << " | Ответ (x * w) = " << (x->data * w->data) << "\n";
//     }
//     return 0;
// }

// [Крутилка w]  <--  [Коробка pred]  <--  [Коробка diff]  <--  [Коробка loss]
//  (x = 2)            (x * w = 6)         (6 - 10 = -4)       (-4 * -4 = 16)

// w->grad = -16  <--  pred->grad = -8 <--  diff->grad = -8 <--  loss->grad = 1
//  (умножили           (передали -8         (прибавили -4        (стартовая
//   -8 на x=2)          1-в-1)               два раза)            единица)


int main(){
    test_addition();
    test_substraction();
    test_multiplication();
    test_tahn();
    test_backward_training();

    return 0;

}